In [10]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[25,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_cleaned=df.dropna(subset=['Salary'])
df_cleaned

      Name   Age   Salary
0    Alice  25.0  50000.0
2  Charlie   NaN  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [11]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[25,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_cleaned_all=df.dropna(how='all')
df_cleaned_all

      Name   Age   Salary
0    Alice  25.0  50000.0
1     Blue  32.0      NaN
2  Charlie   NaN  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [9]:
import pandas as pd
data={'Name':[None,'Blue','Charlie','Delta','Echo'],'Age':[None,32,None,41,28],'Salary':[None,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_cleaned_all=df.dropna(how='all')
df_cleaned_all

      Name   Age   Salary
1     Blue  32.0      NaN
2  Charlie   NaN  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [15]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[25,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_cleaned_all=df.dropna(how='any')
df_cleaned_all

    Name   Age   Salary
0  Alice  25.0  50000.0
3  Delta  41.0  90000.0
4   Echo  28.0  60000.0

In [16]:
import pandas as pd
import numpy as np
data={'Name':['Alice','Blue','Charlie','Delta','Echo','Blue','Charlie','Echo'],'Age':[25,32,np.nan,41,28,32,np.nan,38],'Salary':[50000,np.nan,70000,90000,60000,np.nan,70000,60000]}
df=pd.DataFrame(data)
~df.duplicated()

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7     True
dtype: bool

In [24]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[25,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_filled=df.fillna(10)
df_filled

      Name   Age   Salary
0    Alice  25.0  50000.0
1     Blue  32.0     10.0
2  Charlie  10.0  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [23]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[25,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_filled=df.fillna(method='ffill')
df_filled

      Name   Age   Salary
0    Alice  25.0  50000.0
1     Blue  32.0  50000.0
2  Charlie  32.0  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [21]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[25,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_filled=df.fillna(method='bfill')
df_filled

      Name   Age   Salary
0    Alice  25.0  50000.0
1     Blue  32.0  70000.0
2  Charlie  41.0  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [22]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[None,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_filled=df.fillna(method='ffill')
df_filled

      Name   Age   Salary
0    Alice   NaN  50000.0
1     Blue  32.0  50000.0
2  Charlie  32.0  70000.0
3    Delta  41.0  90000.0
4     Echo  28.0  60000.0

In [31]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[None,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df_mean=df.fillna(df.mean())
df_mean

C:\Users\admin\AppData\Local\Temp\ipykernel_6972\3918332240.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_mean=df.fillna(df.mean())

      Name        Age   Salary
0    Alice  33.666667  50000.0
1     Blue  32.000000  67500.0
2  Charlie  33.666667  70000.0
3    Delta  41.000000  90000.0
4     Echo  28.000000  60000.0

In [1]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[None,32,None,41,28],'Salary':[50000,None,70000,90000,60000]}
df=pd.DataFrame(data)
df.isnull().sum()

Name      0
Age       2
Salary    1
dtype: int64

In [3]:
import pandas as pd
data={'Name':['Alice','Blue','Charlie','Delta','Echo'],'Age':[None,32,None,41,28],'Salary':[50000,None,70000,90000,50000]}
df=pd.DataFrame(data)
df.nunique()

Name      5
Age       3
Salary    3
dtype: int64